In [120]:
import pandas as pd
import numpy as np

In [121]:
data = pd.read_csv('E:\Pycharm Projects\Code Warriors\PyNative\Pandas Excersises\Automobile_data.csv', na_values={
'price':["?","n.a"],
'stroke':["?","n.a"],
'horsepower':["?","n.a"],
'peak-rpm':["?","n.a"],
'average-mileage':["?","n.a"]})
data.tail(7)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0
55,80,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7775.0
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [122]:
data.columns

Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

In [123]:
data[['company', 'price']][data['price'] ==data.price.min() ]

      company   price
13  chevrolet  5151.0

In [124]:
data.price.min()

5151.0

In [125]:
data[data.company=="toyota"]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

In [143]:
df = data.groupby(by= ['price'])
df.head(10)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
...,...,...,...,...,...,...,...,...,...,...
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [166]:
data.groupby("body-style")['price', 'average-mileage'].max()

<ipython-input-166-33ab03a56b2a>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby("body-style")['price', 'average-mileage'].max()

               price  average-mileage
body-style
convertible  37028.0               21
hardtop      45400.0               17
hatchback    16500.0               47
sedan        41315.0               45
wagon        28248.0               31

In [172]:
data.groupby('company')['company', 'average-mileage'].mean()

<ipython-input-172-cd0df4ef82db>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby('company')['company', 'average-mileage'].mean()

               average-mileage
company
alfa-romero          20.333333
audi                 20.000000
bmw                  19.000000
chevrolet            41.000000
dodge                31.000000
honda                26.333333
isuzu                33.333333
jaguar               14.333333
mazda                28.000000
mercedes-benz        18.000000
mitsubishi           29.500000
nissan               31.400000
porsche              17.000000
toyota               28.714286
volkswagen           31.750000
volvo                23.000000

In [224]:
data.sort_values(by=['company', 'horsepower', 'price'])[['company', 'horsepower', 'price']].head(30)

        company  horsepower    price
0   alfa-romero         111  13495.0
1   alfa-romero         111  16500.0
2   alfa-romero         154  16500.0
3          audi         102  13950.0
5          audi         110  15250.0
6          audi         110  18920.0
4          audi         115  17450.0
7           bmw         101  16430.0
8           bmw         101  16925.0
9           bmw         121  20970.0
10          bmw         182  30760.0
12          bmw         182  36880.0
11          bmw         182  41315.0
13    chevrolet          48   5151.0
14    chevrolet          70   6295.0
15    chevrolet          70   6575.0
17        dodge          68   6229.0
16        dodge          68   6377.0
18        honda          76   7295.0
20        honda         100  10345.0
19        honda         101  12945.0
22        isuzu          70      NaN
23        isuzu          70      NaN
21        isuzu          78   6785.0
24       jaguar         176  32250.0
25       jaguar         176  35550.0
26       jaguar         262  36000.0
27        mazda          68   5195.0
28        mazda          68   6095.0
29        mazda          68   6795.0

In [204]:
pd.pivot_table(data, values= "price", index= "company",fill_value= "0", margins= True, aggfunc= np.mean )

                      price
company
alfa-romero    15498.333333
audi           16392.500000
bmw            27213.333333
chevrolet       6007.000000
dodge           6303.000000
honda          10195.000000
isuzu           6785.000000
jaguar         34600.000000
mazda           9654.800000
mercedes-benz  35040.000000
mitsubishi      6689.000000
nissan          8289.000000
porsche        35528.000000
toyota          8216.857143
volkswagen      8435.000000
volvo          13177.500000
All            15387.000000

In [226]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
JapaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}
df_gc = pd.DataFrame.from_dict(GermanCars)
df_jc = pd.DataFrame.from_dict(JapaneseCars)
pd.concat([df_gc, df_jc], keys= ['German', 'Japanese'])

                Company   Price
German   0         Ford   23845
         1     Mercedes  171995
         2          BMV  135925
         3         Audi   71400
Japanese 0       Toyota   29995
         1        Honda   23600
         2       Nissan   61500
         3  Mitsubishi    58900